Lid_Driven_Cavity_Project/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    Fixed_Walls
    {
        type            patch;
        nFaces          225;
        startFace       11100;
    }
    Front_And_Back
    {
        type            empty;
        nFaces          11250;
        startFace       11325;
    }
    Moving_Wall
    {
        type            patch;
        nFaces          75;
        startFace       22575;
    }
)

// ************************************************************************* //
